Revit 2027 API
DividedPathMeasurementType Enumeration
 DividedPath measurement type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DividedPathMeasurementType
Public Enumeration DividedPathMeasurementType
public enum class DividedPathMeasurementType
type DividedPathMeasurementType
Members
Member name | Value | Description
ChordLength | 0 |  Distances between two points are measured along a straight line between the points.
SegmentLength | 1 |  Distances between two points are measured along the path segment between the points.
See Also
Reference
Autodesk.Revit.DB Namespace